; domain
(define (domain NUT-ASSEMBLY)
  (:requirements :strips :typing)

  ;; Types
  (:types nut peg robot)

  ;; Predicates
  (:predicates
    (handempty ?r - robot)
    (grasped ?r - robot ?n - nut)
    (on_peg ?n - nut ?p - peg)
    (assembled ?n - nut)

    ;; Type predicates
    (is_hex ?n - nut)
    (is_square ?n - nut)
    (is_circular ?p - peg)
    (is_square_peg ?p - peg)

    ;; Compatibility
    (compatible ?n - nut ?p - peg)
  )

  ;; Pick action
  (:action pick
    :parameters (?r - robot ?n - nut)
    :precondition (handempty ?r)
    :effect (and 
      (grasped ?r ?n)
      (not (handempty ?r))
    )
  )

  ;; Generic Place action using compatibility
  (:action place
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (compatible ?n ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
    )
  )
)

; problem
(define (problem nut-assembly)
  (:domain NUT-ASSEMBLY)

  (:objects
    robot1 - robot
    hexnut1 hexnut2 squarenut  - nut
    square round - peg
  )

  (:init

    ;; Robot is not holding anything
    (handempty robot1)

    ;; Nut types
    (is_hex hexnut1)
    (is_hex hexnut2)
    (is_square squarenut)

    ;; Peg types
    (is_square_peg square)
    (is_circular round)

    ;;compatibility
    (compatible hexnut1 round)
    (compatible hexnut2 round)
    (compatible squarenut square)
  )

  (:goal
    (and
      (assembled hexnut2)
      (assembled squarenut)
      (assembled hexnut1)
    )
  )
)

; plan
1. (pick robot1 hexnut1)
   deleted: (handempty robot1)
   added: (grasped robot1 hexnut1)
   goals met: 0 of 3
2. (place robot1 hexnut1 round)
   deleted: (grasped robot1 hexnut1)
   added: (on_peg hexnut1 round) (assembled hexnut1) (handempty robot1)
   goals met: 1 of 3
3. (pick robot1 squarenut)
   deleted: (handempty robot1)
   added: (grasped robot1 squarenut)
   goals met: 1 of 3
4. (place robot1 squarenut square)
   deleted: (grasped robot1 squarenut)
   added: (on_peg squarenut square) (assembled squarenut) (handempty robot1)
   goals met: 2 of 3
5. (pick robot1 hexnut2)
   deleted: (handempty robot1)
   added: (grasped robot1 hexnut2)
   goals met: 2 of 3
6. (place robot1 hexnut2 round)
   deleted: (grasped robot1 hexnut2)
   added: (on_peg hexnut2 round) (assembled hexnut2) (handempty robot1)
   goals met: 3 of 3
